Riktastic/Neo2Buddy/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_FREERTOS_HZ=1000
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Olimex ESP32-S3-DevKit-Lipo: ESP32-S3-WROOM-1-N8R8 (8 MB flash + 8 MB octal PSRAM).
# CH340 UART has no reliable auto-reset; use BUT1+RST1 before flashing.
CONFIG_ESPTOOLPY_BEFORE_NORESET=y

# On-module octal PSRAM — keep only tiny / DMA-critical allocs in internal DRAM.
# ALWAYSINTERNAL must stay well below the httpd task stack (~16–24 KB), otherwise
# FreeRTOS stacks land in INTERNAL and BLE (needs ~24 KB contiguous) cannot start.
# 1024 keeps more medium allocs in PSRAM and reduces INTERNAL fragmentation.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=1024
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=49152
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# HTTPS (OpenAI): TLS buffers are large; put mbedtls in PSRAM + dynamic RX/TX.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=8192
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=y
# CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE is not set
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y

CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
# Persist BLE bonds / CCCDs across reboot so a paired phone reconnects.
CONFIG_BT_NIMBLE_NVS_PERSIST=y
# One live HID host at a time; keep a few stored bonds for reconnect convenience.
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_BONDS=3
CONFIG_BT_NIMBLE_SECURITY_ENABLE=y
# Prefer PSRAM for NimBLE pools so Wi-Fi + HTTP keep contiguous INTERNAL DRAM.
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4096
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_COUNT=8
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_COUNT=16
# HID keyboard = advertise + accept one peripheral link (no central/observer scan).
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
# CONFIG_BT_NIMBLE_ROLE_CENTRAL is not set
# CONFIG_BT_NIMBLE_ROLE_OBSERVER is not set
CONFIG_BT_NIMBLE_WHITELIST_SIZE=4
CONFIG_BT_NIMBLE_MAX_CCCDS=16
# Full HOGP via esp_hid / ble_svc_hid (Input + LED Output + boot reports).
CONFIG_BT_NIMBLE_HID_SERVICE=y
CONFIG_BT_NIMBLE_SVC_HID_MAX_RPTS=4
# Quiet per-keystroke "GATT procedure initiated: notify" spam on serial.
CONFIG_BT_NIMBLE_LOG_LEVEL_WARNING=y
# Authenticated pairing level preferred by iOS HID hosts (passkey 123456).
CONFIG_BT_NIMBLE_SM_LVL=0
/* 1 connection + 1 connectable advertiser — MAX_ACT=1 returns HCI 0x07 / 519
 * (BLE_ERR_MEM_CAPACITY) on ble_gap_adv_start. */
CONFIG_BT_CTRL_BLE_MAX_ACT=2
# Observer/scan caches are unused as HID peripheral — keep tiny.
CONFIG_BT_CTRL_ADV_DUP_FILT_MAX=10
CONFIG_BT_CTRL_BLE_ADV_REPORT_FLOW_CTRL_NUM=20
CONFIG_BT_CTRL_SCAN_DUPL_CACHE_SIZE=20
CONFIG_BT_ALARM_MAX_NUM=20

# SSD1306 OLED driver uses the legacy I2C driver API.
CONFIG_I2C_ENABLE_LEGACY_DRIVER=y

# Neo2 Buddy feature toggles (see main/Kconfig).
CONFIG_SUPPORT_BATTERY=y
CONFIG_SUPPORT_SDCARD=y
CONFIG_SUPPORT_OLED=y
CONFIG_SUPPORT_WIFI_WEB=y
CONFIG_SUPPORT_BLE=y
CONFIG_SUPPORT_STOCK_APPLETS=y
CONFIG_BUDDY_UART_CMD=y

# Mobile browsers send large Cookie/User-Agent headers on captive portal join.
# Keep URI modest — long URIs cost httpd scratch; portal paths are short.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_HTTPD_PURGE_BUF_LEN=128
CONFIG_LWIP_MAX_SOCKETS=16
# ~5× MSS: enough for SoftAP CSS/JS without starving httpd INTERNAL DRAM.
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=7200
CONFIG_LWIP_TCP_WND_DEFAULT=7200

# Neo Link: archived/abandoned (USB emulate mode blocks live applet UI).
# CONFIG_BUDDY_NEO_LINK is not set
# CONFIG_BUDDY_NEO_LINK_AUTO_INSTALL_APPLET is not set

# app_main runs SPIFFS, self-test, then spawns startup_task; BLE/Wi-Fi/HTTP need depth.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Lower peak Wi-Fi TX power to reduce USB brownout resets during STA auth.
CONFIG_ESP_PHY_MAX_WIFI_TX_POWER=15
CONFIG_ESP_PHY_REDUCE_TX_POWER=y

# Wi-Fi/IP events run on sys_evt; keep handlers minimal and give the task headroom.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# USB host (Neo2 OTG) shares the internal USB PHY with USB Serial/JTAG — disable
# secondary console on USJ so host mode can take the PHY without conflict.
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
# CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG is not set

# SPIFFS object names must fit dated backup filenames (flat under /spiflash).
CONFIG_SPIFFS_OBJ_NAME_LEN=64

# Neo2 USB connect can be slow / flaky — give enumeration more time.
CONFIG_USB_HOST_DEBOUNCE_DELAY_MS=500
CONFIG_USB_HOST_RESET_RECOVERY_MS=100
CONFIG_USB_HOST_SET_ADDR_RECOVERY_MS=50
